#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevOpsKats/AWSDevOpsKats-ECS/runs/run-WQZwwueDLtLGbPGB

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.package_in_docker.local_file.archive_plan[0]: Refreshing state... [id=54044c7697891c13d499e3e2f247e7a55870a346]
module.package_in_docker.null_resource.archive[0]: Refreshing state... [id=5351562026304106681]
aws_ssm_parameter.develop_smtp_port: Refreshing state... [id=/devopskats/develop/smtp/port]
aws_ssm_parameter.master_smtp_port: Refreshing state... [id=/devopskats/master/smtp/port]
aws_ssm_parameter.master_smtp_server: Refreshing state... [id=/devopskats/master/smtp/server]
aws_efs_file_system.develop: Refreshing state... [id=fs-0aff87e0b7aa5d986]
aws_ssm_parameter.master_smtp_password: Refreshing state... [id=/devopskats/master/smtp/password]
module.ecs[1].module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:816939196156:cluster/master-devops]
module.deploy_user.aws_iam_user.this[0]: Refreshing state... [id=giithub-action-deploy-ecs-deploy]
module.deploy_group.aws_iam_group.this[0]: Refreshing state... [id=deploy_group]
module.ecs[1].aws_cloudwatch_log_group.this: Refreshing state... [id=devopskats-master]
aws_cloudwatch_event_rule.hourly: Refreshing state... [id=auto-remove-ecs-service-hourly]
aws_ssm_parameter.develop_smtp_password: Refreshing state... [id=/devopskats/develop/smtp/password]
aws_iam_role.deploy_user: Refreshing state... [id=devopskats-deploy]
aws_efs_file_system.master: Refreshing state... [id=fs-076d94d6dcf153360]
module.ecs[0].module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:816939196156:cluster/develop-devops]
module.ecs[0].aws_cloudwatch_log_group.this: Refreshing state... [id=devopskats-develop]
aws_ssm_parameter.master_smtp_username: Refreshing state... [id=/devopskats/master/smtp/username]
aws_ssm_parameter.develop_smtp_server: Refreshing state... [id=/devopskats/develop/smtp/server]
aws_iam_role.container: Refreshing state... [id=devopskats-container]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=devopskats-ecsTaskExecutionRole]
aws_ssm_parameter.develop_smtp_username: Refreshing state... [id=/devopskats/develop/smtp/username]
module.deploy_user.aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA34NK6336CJPVCROP]
module.deploy_group.aws_iam_group_membership.this[0]: Refreshing state... [id=deploy_group]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auto-remove-ecs-service]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=auto-remove-ecs-service]
module.lambda_function.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::816939196156:policy/auto-remove-ecs-service-inline]
module.alb_master.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816939196156:targetgroup/master-devops/a5b3cd28f05e4bba]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0b2c5b7733dcb6be0]
aws_security_group.master_alb: Refreshing state... [id=sg-006eb0a46ccafcde5]
module.alb_master.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816939196156:loadbalancer/app/master-devops/7625e8fab2cee400]
aws_security_group.master_ecs_tasks: Refreshing state... [id=sg-0803c5dd7fca09fbd]
aws_iam_role_policy.container: Refreshing state... [id=devopskats-container:devopskats-container]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=devopskats-ecsTaskExecutionRole-20220105111606494100000001]
module.ecs[1].aws_ecs_task_definition.this: Refreshing state... [id=master-devops]
aws_iam_role_policy.agent: Refreshing state... [id=devopskats-ecsTaskExecutionRole:devopskats-agent]
module.ecs[0].aws_ecs_task_definition.this: Refreshing state... [id=develop-devops]
module.deploy_group.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::816939196156:policy/AllowECSDeployment]
module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=auto-remove-ecs-service-20220209161110412300000002]
aws_security_group.efs: Refreshing state... [id=sg-0f5cfb59e8209a95e]
module.alb_master.aws_lb_listener.http_forward[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816939196156:listener/app/master-devops/7625e8fab2cee400/6a93459ad783558d]
module.deploy_group.aws_iam_group_policy_attachment.custom[0]: Refreshing state... [id=deploy_group-20220103151548477200000002]
aws_efs_mount_target.develop: Refreshing state... [id=fsmt-004d71ec0703b583f]
aws_efs_mount_target.master: Refreshing state... [id=fsmt-059154582db2f67c2]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::816939196156:policy/auto-remove-ecs-service-logs]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=auto-remove-ecs-service]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auto-remove-ecs-service-20220209161110405800000001]
module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["OneRule"]: Refreshing state... [id=OneRule]
aws_cloudwatch_event_target.lambda_function: Refreshing state... [id=auto-remove-ecs-service-hourly-terraform-20220116110946217000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_function.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      ~ id      = "1861255451" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:UpdateService",
                          - "ecs:List*",
                          - "ecs:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ecsdeleteservice"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "3263443194" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*:*",
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.lambda_function.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.lambda_function.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-inline"
        name      = "auto-remove-ecs-service-inline"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:UpdateService",
                          - "ecs:List*",
                          - "ecs:Describe*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ecsdeleteservice"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Env" = "develop"
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::816939196156:policy/auto-remove-ecs-service-logs"
        name      = "auto-remove-ecs-service-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*:*",
                          - "arn:aws:logs:us-east-1:816939196156:log-group:/aws/lambda/auto-remove-ecs-service:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Env" = "develop"
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auto-remove-ecs-service"
        name                  = "auto-remove-ecs-service"
        tags                  = {
            "Env" = "develop"
        }
      ~ tags_all              = {
          + "env"         = "development"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.package_in_docker.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5351562026304106681" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1644726068304657000" -> "1644729330942884000"
            # (1 unchanged element hidden)
        }
    }

Plan: 1 to add, 3 to change, 1 to destroy.


```

</details>

*Pusher: @chiplonton, Action: `pull_request`*